Revit 2027 API
RectangularGridSegmentOrientation Enumeration
 The orientation type of rectangular grid segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RectangularGridSegmentOrientation
Public Enumeration RectangularGridSegmentOrientation
public enum class RectangularGridSegmentOrientation
type RectangularGridSegmentOrientation
Members
Member name | Value | Description
Horizontal | 1 |  A horizontal GridSegment
Vertical | 0 |  A vertical GridSegment
See Also
Reference
Autodesk.Revit.DB Namespace